docs: refine project documentation
